In [3]:
import pandas as pd

In [5]:
df_raw = pd.DataFrame({
    'var1' : [1,2,1],
    'var2' : [2,3,2]
})

In [7]:
df_raw

   var1  var2
0     1     2
1     2     3
2     1     2

In [13]:
df_new = df_raw.copy() #복사본 제작

In [15]:
df_new

   var1  var2
0     1     2
1     2     3
2     1     2

In [17]:
df_new = df_new.rename(columns = {'var2' : 'v2'})

In [19]:
df_new

   var1  v2
0     1   2
1     2   3
2     1   2

In [21]:
df_raw

   var1  var2
0     1     2
1     2     3
2     1     2

In [23]:
df_new

   var1  v2
0     1   2
1     2   3
2     1   2

In [25]:
#복사본에서만 수정이 된다.